Repository: boeckMt/demo_angular_translation
Catalog: src/locale/messages.*.xlf
Languages: de_de

# app.title
source: translateMe-App
de_de: ÜbersetsMich-App

source: I'm a translated app with the name {{title}}
de_de: Ich bin eine übersetzte App mit dem Namen {{title}}

source: I'm a translated Text in a template
de_de: Ich bin ein übersetzter Text in einem template

source: I18n is a custom attribute, recognized by Angular tools and compilers. After translation, the compiler removes it. It is not an Angular directive.
de_de: I18n ist ein benutzerdefiniertes Attribut, das von Angular-Tools und -Compilern erkannt wird. Nach der Übersetzung entfernt der Compiler sie. Es ist keine Angular-Direktive.

source: Add helpful descriptions and meanings as the value of the i18n attribute
de_de: Fügen Sie hilfreiche Beschreibungen und Bedeutungen als Wert des i18n-Attributs hinzu

source: Hello i18n!
de_de: Hallo i18n!

source: I don't output any element
de_de: Ich gebe kein Element aus

source: Angular logo
de_de: Angular Bild

source: I'm a title
de_de: Ich bin ein Titel

source: Text with a title attribute
de_de: Text mit einem Titelattribut

source: {VAR_PLURAL, plural, =0 {just now} =1 {one minute ago} other {{INTERPOLATION} minutes ago}}
de_de: {VAR_PLURAL, plural, =0 {grade eben} =1 {vor einer Minute} andere {il y a {{minutes}}minuten vorher} }

source: Updated {minutes, plural, =0 {just now} =1 {one minute ago} other {{{minutes}} minutes ago}}
de_de: Updated {minuten, plural, =0 {...} =1 {...} other {...}}

source: {VAR_SELECT, select, male {male} female {female} other {other}}
de_de: {VAR_SELECT, select, male {ein Mann} female {eine Frau} other {anderst} }

source: The author is {gender, select, male {male} female {female} other {other}}
de_de: Der Author ist {gender, select, male {...} weiblich {...} anderst {...}}

source: {VAR_PLURAL, plural, =0 {just now} =1 {one minute ago} other {{INTERPOLATION} minutes ago by {VAR_SELECT, select, male {male} female {female} other {other}}}}
de_de: {VAR_PLURAL, plural, =0 {gerade eben} =1 {eine Minute vorher} anders {{{minutes}}minuten vorher {VAR_SELECT, select, male {male} female {female} other {other} }} }

source: Updated: {minutes, plural, =0 {just now} =1 {one minute ago} other {{{minutes}} minutes ago by {gender, select, male {male} female {female} other {other}}}}
de_de: Updated: {minutes, plural, =0 {...} =1 {...} other {...}}

# paragraphInAppTemplate
source: Hello i18n!
de_de: Hallo i18n!

# introductionHeader1
source: Use a custom ID with a description
de_de: Verwenden Sie eine benutzerdefinierte ID mit einer Beschreibung

# introductionHeader2
source: Use a custom ID with a description and meaning
de_de: Verwenden Sie eine benutzerdefinierte ID mit einer Beschreibung und Bedeutung

source: Today is {{today | date}}
de_de: Heute ist der {{today | date}}

source: I'm the Number {{decimalNumber | number}}
de_de: Ich bin die Nummer {{decimalNumber | number}}

source: This APP costs {{price|currency:'EUR':'symbol'}}
de_de: Diese App kostet {{price|currency:'EUR':'symbol'}}

source: Formatted number in script file {{formatedNumber}} and {{formatedNumberWhithDecimalPipe}}
de_de: Formatierte Nummer in der Skriptdatei {{formatedNumber}} and {{formatedNumberWhithDecimalPipe}}

source: I'm using the PercentPipe {{percentNumber | percent}}
de_de: Ich nütze die PercentPipe {{percentNumber | percent}}

# app.route1
source: route1
de_de: Rute 1
